Revit 2027 API
ContinuousRailType.StartOrBottomExtensionStyle Property
 The extension style of the rail termination at the beginning or bottom.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RailExtensionStyle StartOrBottomExtensionStyle { get; set; }
Public Property StartOrBottomExtensionStyle As RailExtensionStyle
	Get
	Set
public:
property RailExtensionStyle StartOrBottomExtensionStyle {
	RailExtensionStyle get ();
	void set (RailExtensionStyle value);
}
member StartOrBottomExtensionStyle : RailExtensionStyle with get, set
Property Value
RailExtensionStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace